10/data/attachments/f90d2d9ff627bd92.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7444482f-8ed0-41ff-ad95-d03ed854b623</nif:username>
            <nif:friendToBeAdded>Andrea_both_Friend_28525_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>